InformationRegisters/RVY_Вебхуки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>RVY_Вебхуки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контакт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/RVY_ОбщийМодульВызовСервера/Ext/Module.bsl
//#13148

#Область ПрограммныйИнтерфейс

// Получает состояние документа из регистра
// возвращаемое значение
// 0 - документа нет в регистре
// 1 - документ есть в регистре, но не отправлен
// 2 - документ есть в регистре, и отправлен
Функция ПолучитьСостояниеДокумента(ОбъектСсылка) Экспорт	

	СтруктураВозврата = Новый Структура("Состояние, ДатаОтправки", 0, Дата(1,1,1));
	
	Если НЕ ЗначениеЗаполнено(ОбъектСсылка) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.RVY_Вебхуки.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Документ = ОбъектСсылка;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		Если ЗначениеЗаполнено(МенеджерЗаписи.ДатаОтправки) Тогда
			СтруктураВозврата.Состояние = 2;
			СтруктураВозврата.ДатаОтправки = МенеджерЗаписи.ДатаОтправки;
		Иначе
			СтруктураВозврата.Состояние = 1;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция СохранитьСостояниеДокумента(ОбъектСсылка, Контакт, НомерТелефона, ДатаДобавления, ДатаОтправки = Неопределено) Экспорт

	Если НЕ ЗначениеЗаполнено(ОбъектСсылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.RVY_Вебхуки.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Документ = ОбъектСсылка;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда		
		МенеджерЗаписи.ДатаДобавления = ДатаДобавления;
		МенеджерЗаписи.Контакт = Контакт;
		МенеджерЗаписи.НомерТелефона = НомерТелефона;
		МенеджерЗаписи.ДатаОтправки = ?(ЗначениеЗаполнено(МенеджерЗаписи.ДатаОтправки), МенеджерЗаписи.ДатаОтправки, ?(ДатаОтправки = Неопределено, Дата(1, 1, 1), ДатаОтправки));
		МенеджерЗаписи.Записать(Истина);
	Иначе
		МенеджерЗаписи.Документ = ОбъектСсылка;
		МенеджерЗаписи.ДатаДобавления = ДатаДобавления;
		МенеджерЗаписи.Контакт = Контакт;
		МенеджерЗаписи.НомерТелефона = НомерТелефона;
		МенеджерЗаписи.ДатаОтправки = ?(ДатаОтправки = Неопределено, Дата(1, 1, 1), ДатаОтправки);
		МенеджерЗаписи.Записать();
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьДанныеТокена() Экспорт
	
	НаборКонстант = Константы.СоздатьНабор("RVY_Логин, RVY_Пароль, RVY_Токен, RVY_ДатаПолученияТокена");
	НаборКонстант.Прочитать();
	
	Возврат Новый Структура("Логин, Пароль, Токен, ДатаПолучения", 
							НаборКонстант.RVY_Логин, НаборКонстант.RVY_Пароль, НаборКонстант.RVY_Токен, НаборКонстант.RVY_ДатаПолученияТокена);
	
КонецФункции

Функция СохранитьДанныеТокена(ДанныеТокена) Экспорт
								
	Константы.RVY_Токен.Установить(ДанныеТокена.Токен);
	Константы.RVY_ДатаПолученияТокена.Установить(ДанныеТокена.ДатаПолучения);
	
КонецФункции

#КонецОбласти
